{
  "author": "Tiera Thompson",
  "releasedOn": "2017-11-06T08:00:00.000-05:00",
  "title": "Sprint 9.0 release notes",
  "results": [
    {
      "label": "Issues",
      "content": [
        {
          "text": "(FB 591) The 'daysToRun' setting is now working in the ACAS Interrogator configuration."
        },
        {
          "text": "(FB 649) UI now displays published dates for SV Rules."
        },
        {
          "text": "(FB 599) Resolved an issue where COAMS Tag Numbers would show in the RMK System Tree view on the Enclave Page, when there was no corresponding DITPR number listed in the imported COAMS data.  RMK now shows the system name."
        },
        {
          "text": "(FB 619) Resolved an issue where the asset name wasn't in the excel export. RMK now includes asset Names for failed IAVM Excel exports."
        },
        {
          "text": "(FB 626) Resolved an issue where the launch window loaded assigned organizations during the registration process. RMK now has a popup window that displays assigned \norganizations."
        },
        {
          "text": "(FB 644) Resolved issue where jobs would only run once. Now RMK jobs will restart when necessary.  Job history shows the jobs that ran."
        },
        {
          "text": "(FB 648) Removed the White Pace from the Title in the STIG Vulnerability Listing Page."
        }
      ]
    },
    {
      "label": "Features",
      "content": [
        {
          "text": "(FB 601) Added DITPR IDs to Hierarchy Tree."
        },
        {
          "text": "(FB 643) Added the Severity Category to Top Findings Tool Tip."
        },
        {
          "text": "(FB 605) Added totals to column headers on enclaves assets details."
        },
        {
          "text": "(FB 654) Added ability to filter the Asset List in the Top Findings Pop Out."
        },
        {
          "text": "(FB 642) Added ability to Search by all recognized fields."
        },
        {
          "text": "(FB 613) Changed sorting  of Top Findings Chart from Quantity to Risk."
        },
        {
          "text": "(FB 597) Created a Last Seen 30 Day Report excel spread sheet."
        },
        {
          "text": "(FB 623) Created Asset Vuln Details job that associates assets to their corresponding vulnerabilities for a materialized view."
        },
        {
          "text": "(FB 625) Created a Pop-Out Window to show related assets for each vulnerability listed in the Top Findings Chart."
        },
        {
          "text": "(FB 598) Deprecated Asset Report identifies assets that have been flagged as deprecated because of a heart beat older than 30 days."
        },
        {
          "text": "(FB 618) Developed a new page to display the finding details for enclaves."
        },
        {
          "text": "(FB 641) Added a tooltip that displays enumerated and unique totals on the findings page."
        },
        {
          "text": "(FB 600) Flags and invalidates duplicate ACAS assets."
        },
        {
          "text": "(FB 652) Linked the Top Findings Bar to the referenced finding."
        },        
        {
          "text": "(FB 614) Updated risk Scoring values for sorting algorithm."
        }
      ]
    }
  ]
}