{
  "author": "Tiera Thompson",
  "releasedOn": "2017-12-10T08:00:00.000-05:00",
  "title": "Sprint 11.0 release notes",
  "results": [
    {
      "label": "issues",
      "content": [
        {
          "text": "(FB  670) Resolved an issue that prevented large enclaves from loading. RMK now removes hyperlinks for enclaves with more than 2000 assets."
        },
        {
          "text": "(FB  703) Resolved an issue where organization searches were returning empty results. RMK now has a job that prevents old tags from being applied to new assets. Search results no longer include items with old tags."
        },
        {
          "text": "(FB  717) Addressed issue where Vulnerability sub-table on an Asset List Page were not completely populating. RMK no longer has blank sub-tables."
        },
        {
          "text": "(FB  702) Resolved issue where the Vulnerability Sub-Table wasn't visible for asset lists."
        },
        {
          "text": "(FB  713) Addressed issue where the scroll bars were not scaled properly.  The scroll bars are now properly scaled for large asset lists."
        },
        {
          "text": "(FB  667) Resolved an issue where Asset list columns changed width spacing. RMK now retains proper spacing after expanding/collapsing sections."
        },
        {
          "text": "(FB  701) Resolved issue where the Vulnerability Sub-Table grows in height as the user scrolls down in the list."
        },
        {
          "text": "(FB  710) Resolved an issue where the Feedback Dialogue Header was hidden. RMK now displays the feedback dialogue header."
        },
        {
          "text": "(FB  708) Resolved an issue where no assets were listed in the pop-up window for Top Findings.  RMK now displays assets in the Top Findings pop-up window."
        },
        {
          "text": "(FB  706) Resolved issue where the Enclave Page Hover Tool Tip did not have appropriate wording. RMK now words the Tool Tip correctly."
        },
        {
          "text": "(FB  704) Resolved issue where the Asset Details Page Vulnerability Table, wasn't sizing correctly. RMK now sizes the vulnerability table correctly."
        },
        {
          "text": "(FB  700) Standardized the capitalization of critical in the vulnerabilities sub-table. RMK now shows as Critical."
        },
        {
          "text": "(FB  699) Resolved an issue where filtered assets did not update. RMK now dynamically updates the Filtered Asset List for IAVMs."
        },
        {
          "text": "(FB  698) Resolved an issue where vulnerabilities  were not expanding for an asset.  RMK now expands vulnerabilities for assets."
        },
        {
          "text": "(FB  709) Resolved issue where Scan failures did not display on Asset Page. RMK now displays scan failures on the Asset Page."
        },
        {
          "text": "(FB  666) Removed the blue line from appearing in the enclave vulnerability list."
        },
        {
          "text": "(FB  620) Resolved an issue where the X of Y number on Enclave Assets Details Page did not update. RMK now updates the Enclave Asset Details Page appropriately."
        },
        {
          "text": "(FB  655) Resolved an issue where the severity level filtering did not provide correct options. RMK now displays Critical and CAT II Severity Levels."
        },
        {
          "text": "(FB  668) Resolved issue where large enclaves failed to load. RMK now loads large enclaves incrementally."
        },
        {
          "text": "(FB  707) Addressed issue where the Asset List window would not open from the Top Findings Chart on an Asset Summary Page. RMK now provides a pop up Asset List on an Organization Page."
        },
        {
          "text": "(FB  723) Resolved an issue where a secondary API call from ACAS was being parsed by RMK in an overly restrictive way which precluded RMK from using an available McAfee GUID identifier for disambiguation resulting in the possibility of duplicate assets being created of type acas_invalid_asset or valid electronic_network_asset. RMK now uses the date provided by the Serial API from the ACAS calls."
        }
      ]
    },
    {
      "label": "Features",
      "content": [
        {
          "text": "(FB  697) Added ability to search and return results for organizations."
        },
        {
          "text": "(FB  647) Relocated the Release Notes Link to the Enclave Page. Made Release notes available to all users."
        },
        {
          "text": "(FB  650) Added ability to download CSV reports for vulnerability findings for a given enclave and severity."
        },
        {
          "text": "(FB  712) Enabled filtering by notice ID for the IAVM List view."
        },
        {
          "text": "(FB  711) Removed the option to bookmark the dashboard."
        },
        {
          "text": "(FB  714) Enabled filtering asset list by HBC."
        },
        {
          "text": "(FB  651) Implemented a new feature that presents a banner to the Enclave Summary Page indicating that some data job is in progress."
        }
      ]
    },
    {
      "label": "Project Task",
      "content": [
        {
          "text": "(FB  715)Updated Release notes for Resolved Cases."
        }
      ]
    }
  ]
}