{
  "author": "Thomas Paris",
  "releasedOn": "2017-06-05T08:00:00.000-04:00",
  "title": "Sprint 5.0 release notes",
  "results": [
    {
      "label": "Bug Fixes",
      "content": [
        {
          "text": "(FB 70) Failed/Canceled login.  This is not fixable do to lack of support of the browser to clear the certificate cached request/response."
        },
        {
          "text": "(FB 511) All software was temporarily disabled except for HBBS until we could get the CPE builder correct.  It is now fixed and you should now see other software."
        },
        {
          "text": "(FB 517/519) The grouping will still be disable but now when tile view is selected it will clear the group so it can load."
        },
        {
          "text": "(FB 518) Fixed issue with import history."
        },
        {
          "text": "(FB 520) History importer page no longer auto refreshes not a bug.  You have to click the refresh button now at the top right of the panel."
        },
        {
          "text": "(FB 300) This task was to ensure that the null endpoint bug is no longer reported in the log.  It is not."
        },
        {
          "text": "(FB 512) IAVM compliance export and the search page result for an IAVM now match.  The breakdown report has been removed"
        },
        {
          "text": "(FB 436) Eliminate Secondary Title (Duplicate title)"
        }
      ]
    },
    {
      "label": "New Features",
      "content": [
        {"text": "(FB 469) When searching the user can now scroll and page multiple results."},
        {
          "text": "Added RMK Deduplication page to UI. Personalization is used to store responses. (FB 282)"
        },
        {
          "text": "Added modal disclaimer to enclaves page with a way to no longer view it. (FB 472)"
        },
        {
          "text": "Critical category is now equal to a base score of 10 (FB 481, 493)."
        },
        {
          "text": "In the UI, when viewing data for a STIG on the STIG page, The STIG Release(s) and STIG Group (vlun id) is now shown when viewing a STIG Rule (FB 475, 476, 216)."
        },
        {
          "text": "UI added STIG Release and related Group IDs to vulnerabilities lists (FB 475, 476, 216)."
        },
        {
          "text": "STIG Rules as linked to an asset now displays the related STIG Release(s) and STIG Group(s) (FB 477)."
        },
        {
          "text": "Vulnerability Breakdown Report - In the details section, if the vulnerabilities are STIGs, they are grouped by STIG Release, using bootstrap accordion (FB 478)."
        },
        {
          "text": "Vulnerability Breakdown Report and IAVM Breakdown Report- HTML for the details is not created until category is clicked in the summary. Previous HTML details data is removed when another category is clicked (FB 478)."
        },
        {
          "text": "Search box now has a \"busy\" indicator (FB 495)."
        },
        {
          "text": "Software is now searchable and returns a list of related assets (FB 495)."
        },
        {
          "text": "Updated FRAGO 5 compliance to include RSD (FB 454)."
        },
        {
          "text": "An Excel report is now generated in conjunction with Asset Match Discovery Job (FB 482)."
        },
        { "text": "Enable scoping by Organization."}
      ]
    },
    {
      "label": "Other",
      "content": [
      ]
    }
  ]
}